<?php

use Illuminate\Database\Seeder;

class SettingsTableSeeder extends Seeder
{

    /**
     * Auto generated seed file
     *
     * @return void
     */
    public function run()
    {
        \DB::table('settings')->delete();

        \DB::table('settings')->insert(array(
            0 =>
                array(
                    'id' => 1,
                    'title' => 'МПЦ - ОА Тетовско - гостиварска епархија',
                    'mainurl' => 'Гоце Делчев ББ Тетово Република Македонија',
                    'email' => 'kontakt@tge.mk',
                    'description' => '<p>Роден е на 21. 1. 1982 година во Скопје. По завршувањето на основното образование, во 1997 година се запишува во Македонската православна богословија &bdquo;Свети Климент Охридски&rdquo; во Скопје, која со успех ја завршува во 2002 година. Веднаш потоа го започнува монашкиот подвиг во братството на Бигорскиот манастир &bdquo;Свети Јован Крстител&rdquo;, а воедно, како вонреден студент се запишува на Православниот богословски факултет &bdquo;Свети Климент Охридски&rdquo; во Скопје, каде што дипломира во 2010 година, со одбрана на дипломскиот труд &bdquo;Богородица &ndash; почеток на Новиот Завет&ldquo;. Магистира во 2015 година со одбрана на магистерскиот труд &bdquo;Компаративниот дизај на природата и суштината на македонското црковно и световно (позитивно) казнено право&ldquo;, со што се стекнува со звање магистер по правни науки, насока Правосудство. Замонашен е на 10. 9. 2003 година од страна на неговиот надлежен архиереј, Митрополитот дебарско-кичевски г. Тимотеј. Следната, 2004 година, е ракоположен во ѓаконски чин. За јеромонах е ракоположен на денот на манастирската слава на Бигорската обител, односно на 7. 7. 2006 година. На 28. 6. 2012 година, од страна на Светиот архиерејски синод едногласно е избран за Епископ велички и поставен за викар на Скопската православна епархија, со која раководи Неговото блаженство, Архиепископот охридски и македонски г. г. Стефан. Игуменскот чин го прими во манастирот &bdquo;Свети Наум Охридски&ldquo; &ndash; Охридско, на 3. 7. 2012 година, а за архимандрит е ракоположен на празникот посветен на светите апостоли Петар и Павле, во истоимениот храм во Скопје, на 12. 7. 2012 година. Наречението за епископ се изврши на 6. 10. 2012 година, во манастирот &bdquo;Свети Пантелејмон и свети Климент&ldquo; &ndash; Плаошник, а хиротонијата на 7. 10. 2012 година во катедралниот храм на охридските архиепископи &bdquo;Света Софија&ldquo; во Охрид.</p>
',
                    'logo' => 'logo.png',
                    'logomedium' => 'logo.png',
                    'logothumb' => 'logo.png',
                    'link' => '',
                    'address' => 'Партизански Одреди бр. 12 1000 Скопје',
                    'phone' => '+38923111225',
                    'twitter' => 'https://twitter.com/tgemk',
                    'facebook' => 'https://www.facebook.com/tgemk',
                    'skype' => '',
                    'linkedin' => '',
                    'gplus' => '',
                    'youtube' => '',
                    'flickr' => '',
                    'pinterest' => '',
                    'created_at' => '2018-06-26 15:50:52',
                    'updated_at' => '2018-06-26 15:50:52',
                ),
        ));
    }
}
